# Основные единицы (1-9)
ones = {
    "0": "", "1": "один", "2": "два", "3": "три", "4": "четыре",
    "5": "пять", "6": "шесть", "7": "семь", "8": "восемь", "9": "девять"
}

# Особые случаи (10-19)
teens = {
    "10": "десять", "11": "одиннадцать", "12": "двенадцать", 
    "13": "тринадцать", "14": "четырнадцать", "15": "пятнадцать",
    "16": "шестнадцать", "17": "семнадцать", "18": "восемнадцать", 
    "19": "девятнадцать"
}

# Десятки (20-90)
tens = {
    "2": "двадцать", "3": "тридцать", "4": "сорок", "5": "пятьдесят",
    "6": "шестьдесят", "7": "семьдесят", "8": "восемьдесят", 
    "9": "девяносто"
}
num = list(range(100))
for n in num:
    num[num.index(n)] = str(n)
u_num = input("Введите число от 1 до 99: ")

if not u_num.isdigit():  # проверяем, что введены только цифры
    print("Ошибка: нужно ввести число!")
elif not (1 <= int(u_num) <= 99):  # проверяем диапазон
    print("Ошибка: число должно быть от 1 до 99!")


if u_num not in num:
    print("Введите число")
if len(u_num) == 1:
    res = ones[u_num]
elif len(u_num) == 2:
    if u_num[0] == 1:
        res = teens[u_num]
    else:
        res = tens[u_num[0]] + " " + ones[u_num[1]]
print(res)